/*		What is a PowerSlide file?	--------------------------		It's a JSON file describing one or more tracks.	Different types of drack describe different functionality.	We're only using one track here (a style track), 	so we only need to declare the information for that track.		For information on PowerSlide with multiple tracks, or headers, see the wiki.		Multiple tracks can, for example, have complex cues.	For many uses though, you only need one.		What is a track?	----------------		A track is simply a list of slides. Summary: [{..},{..},{..}] is 3 slides.	Each slide can optionally declare a "start" and a "duration".	When they don't the start and duration times are computed by taking the duration 'gap' and splitting it evenly.		Example:	[{..},{..},{"start":"50%"}]	3 slides with start times of 0%, 25%, 50%. Durations of 25%, 25%, 50%.		Using % allows the overall duration to easily vary.	The overall duration is either declared in a "duration" header, 	or more commonly, as CSS "slides-duration" (which is usually seen as slides:url(..) 4s;)		Your slides must be in order of their start value.	Multiple slides with the same start value do run together.		Cues	----		If you want to wait for something before continuing, that's called a cue.	Declaring cue points requires a cue track.	PowerSlide emits events to cue other things and is cued with element.cue().	*/[	{		/*			This is the first slide.			No 'selector' (or a blank one) means "do this to whatever element 'slides' was applied to".			The below 'animation' field is short for "style":"animation-name:slideup".		*/		"animation":"tipUp"	},	{		/*			This is the second slide.			This time we're using a selector so it will select the 			*child* with a 'tipTitle' class name and slide it in from the right.		*/		"selector":".tipTitle",		"animation":"titleIn"	},	{		/*			Third slide.			This selects the *child* with a 'tipMessage' class name and slide it in from the bottom.		*/		"selector":".tipMessage",		"animation":"messageUp"	}]